# GetStructuralConnectionSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionSettings..::..GetStructuralConnectionSettings Method
StructuralConnectionSettings Class See Also
---
Obtains the StructuralConnectionSettings object for the specified project document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static StructuralConnectionSettings GetStructuralConnectionSettings(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetStructuralConnectionSettings ( _
	document As Document _
) As StructuralConnectionSettings
```

Visual C++
---
```text
public:
static StructuralConnectionSettings^ GetStructuralConnectionSettings(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document A project document.
# ### Return Value
The StructuralConnectionSettings object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | document is not a project document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace